# ============================================================================
# Brewfile — dotfiles dependencies
# Install: brew bundle --file=~/Dev/dotfiles/Brewfile
# ============================================================================

# Taps
tap "felixkratz/formulae"        # SketchyBar + JankyBorders
tap "nikitabobko/tap"            # AeroSpace

# ────────────────────────────────────────────────────────────────────────────
# Shell & Terminal
# ────────────────────────────────────────────────────────────────────────────
brew "antidote"                  # Zsh plugin manager
brew "starship"                  # Prompt
brew "zoxide"                    # Smart cd
brew "fzf"                       # Fuzzy finder

cask "ghostty"                   # Terminal emulator

# ────────────────────────────────────────────────────────────────────────────
# Window Management Stack
# ────────────────────────────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace" # Tiling WM (workspaces + layout)
cask "hammerspoon"               # Lua automation (hold-to-quit, bar toggle)
cask "karabiner-elements"        # Hyper key (Tab → modifier)
cask "rectangle"                 # Float positioning (URL scheme)
brew "felixkratz/formulae/sketchybar"  # Status bar
brew "felixkratz/formulae/borders"     # Window borders

# ────────────────────────────────────────────────────────────────────────────
# Development
# ────────────────────────────────────────────────────────────────────────────
brew "gh"                        # GitHub CLI
brew "go"                        # Go lang
brew "neovim"                    # Editor
brew "docker"                    # Containers
brew "tmux"                      # Terminal multiplexer

# ────────────────────────────────────────────────────────────────────────────
# Utilities
# ────────────────────────────────────────────────────────────────────────────
brew "tree"                      # Directory tree
brew "rsync"                     # File sync
brew "yq"                        # YAML processor
brew "yt-dlp"                    # Video downloader
brew "gum"                       # TUI scripting
brew "osx-cpu-temp"              # CPU temp (used by SketchyBar)
brew "smartmontools"             # Disk health (used by SketchyBar)
brew "nmap"                      # Network scanning

# ────────────────────────────────────────────────────────────────────────────
# Applications
# ────────────────────────────────────────────────────────────────────────────
cask "claude"                    # Claude desktop
cask "cursor"                    # AI code editor
cask "obsidian"                  # Knowledge base
cask "raycast"                   # Launcher
cask "figma"                     # Design
cask "slack"                     # Comms
cask "discord"                   # Comms
cask "notion"                    # Team PM

# ────────────────────────────────────────────────────────────────────────────
# Fonts
# ────────────────────────────────────────────────────────────────────────────
cask "font-iosevka-aile"         # Primary UI font (SketchyBar)
cask "font-jetbrains-mono-nerd-font"  # Terminal nerd font
cask "font-symbols-only-nerd-font"    # Nerd font symbols
cask "font-inter"                # Sans-serif
cask "font-geist"                # Sans-serif
cask "font-geist-mono"           # Mono
cask "font-maple-mono"           # Mono
cask "font-commit-mono"          # Mono
